---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyTypeComments
source: html/5df13901-e4fe-c325-a90a-d26e74f333f4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyTypeComments Property

"Assembly: Type Comments"

## Syntax (C#)
```csharp
public static ForgeTypeId SheetAssemblyTypeComments { get; }
```